void main()
{
    // В c++ есть 4 фундаментальных типов
    bool bl = true; // bool - логический тип и имеет она только два варианта значение true & false
    int num = 10; // int - для целых чисел
    char ch = 'y'; // char - для символов
    double db = 10.3; // double - для чисел с плавающей точкой
    // а все остальные типы служат для оптимизации или решении определенных задач

    // void - тип определение пустоты
    // enum - перечисление типов для конечного набора значении

    // (1) bool, char, int - это интегральные типы
    // (2) а (1) и число с плавающей точкой (double) это арифметический тип
    // (3) Перечисление и классы - они называются определяемые типы так как до их использование нужно самому их реализовать
}